Autodesk.Revit.DB.ISiteInsertServerProxy.UpdateSiteData(Autodesk.Revit.DB.SiteInsertServiceData)
The method that Revit will invoke to update the site data.
data:
The site insert data.
Returns:
Indicates whether the site insert server is executed successfully.
Since:
2018